<?php
/**
 * entry point : main.php
 *
 * この処理系は次の機能を実現します。
 *
 * - get parameterで都道府県コードが与えられた場合に、対応する都道府県名を表示する。
 */

//==============================================
// クラスファイル読み込み
//==============================================
require_once sprintf('%s/functions.php', __DIR__);
require_once sprintf('%s/Prefecture.php', __DIR__);
require_once sprintf('%s/Validator.php', __DIR__);

//==============================================
// 初期化
//==============================================
$pref_cd = $_GET['pref_cd'] ?? null;

//==============================================
// 入力値検証
//==============================================
$obj = new Prefecture();
if ($obj->getName($pref_cd) == '') {
	echo 'エラーが発生しました。';
	exit;
}

//==============================================
// 表示
//==============================================
$obj = new Prefecture();
echo $obj->getName($pref_cd);
